In [1]:
import pandas as pd
import numpy as np

In [8]:
df = pd.DataFrame({
    'A': np.arange(6),
    'B': pd.Timestamp('20210323'),
    'C': pd.Series([12, 34, 56, 2, np.nan, 12]),
    'D': pd.Categorical(['T', 'F', 'F', 'T', 'T', 'T'])
})
df

   A          B     C  D
0  0 2021-03-23  12.0  T
1  1 2021-03-23  34.0  F
2  2 2021-03-23  56.0  F
3  3 2021-03-23   2.0  T
4  4 2021-03-23   NaN  T
5  5 2021-03-23  12.0  T

In [10]:
df['A']

0    0
1    1
2    2
3    3
4    4
5    5
Name: A, dtype: int32

In [11]:
df[0:3]

   A          B     C  D
0  0 2021-03-23  12.0  T
1  1 2021-03-23  34.0  F
2  2 2021-03-23  56.0  F

In [12]:
df.shape

(6, 4)

In [15]:
df.loc[1]

A                      1
B    2021-03-23 00:00:00
C                     34
D                      F
Name: 1, dtype: object

In [16]:
df.loc[:, ['A','B']]

   A          B
0  0 2021-03-23
1  1 2021-03-23
2  2 2021-03-23
3  3 2021-03-23
4  4 2021-03-23
5  5 2021-03-23

In [17]:
df.loc[1:3, ['A','B']]

   A          B
1  1 2021-03-23
2  2 2021-03-23
3  3 2021-03-23

In [19]:
df.loc[1, 'B']

Timestamp('2021-03-23 00:00:00')

### Selection by position

In [20]:
df.iloc[1]

A                      1
B    2021-03-23 00:00:00
C                     34
D                      F
Name: 1, dtype: object

In [23]:
df.iloc[[1,2,3], [0,2,3]]

   A     C  D
1  1  34.0  F
2  2  56.0  F
3  3   2.0  T

In [24]:
df.iloc[0:2, 1:3]

           B     C
0 2021-03-23  12.0
1 2021-03-23  34.0

In [25]:
df.iloc[1,2]

34.0

### Boolean Indexing

In [26]:
df

   A          B     C  D
0  0 2021-03-23  12.0  T
1  1 2021-03-23  34.0  F
2  2 2021-03-23  56.0  F
3  3 2021-03-23   2.0  T
4  4 2021-03-23   NaN  T
5  5 2021-03-23  12.0  T

In [27]:
df[df['C'] > 15]

   A          B     C  D
1  1 2021-03-23  34.0  F
2  2 2021-03-23  56.0  F

In [30]:
df2 = df.copy
df2

<bound method NDFrame.copy of    A          B     C  D
0  0 2021-03-23  12.0  T
1  1 2021-03-23  34.0  F
2  2 2021-03-23  56.0  F
3  3 2021-03-23   2.0  T
4  4 2021-03-23   NaN  T
5  5 2021-03-23  12.0  T>

### Setting

In [31]:
s1 = pd.Series([1,4,7,9,1,0])

In [32]:
df['E'] = s1

In [33]:
df

   A          B     C  D  E
0  0 2021-03-23  12.0  T  1
1  1 2021-03-23  34.0  F  4
2  2 2021-03-23  56.0  F  7
3  3 2021-03-23   2.0  T  9
4  4 2021-03-23   NaN  T  1
5  5 2021-03-23  12.0  T  0

In [36]:
df.iat[0, 2] = 14

In [37]:
df

   A          B     C  D  E
0  0 2021-03-23  14.0  T  1
1  1 2021-03-23  34.0  F  4
2  2 2021-03-23  56.0  F  7
3  3 2021-03-23   2.0  T  9
4  4 2021-03-23   NaN  T  1
5  5 2021-03-23  12.0  T  0